UPDATE import.osm_streets SET has_error =
((
                trim(both ' ' from regexp_replace(name, '\A\s*', '')) != name
                OR trim(both ' ' from regexp_replace(name_uk, '\A\s*', '')) != name_uk
                OR trim(both ' ' from regexp_replace(name_ru, '\A\s*', '')) != name_ru
                OR trim(both ' ' from regexp_replace(name_be, '\A\s*', '')) != name_be
            ) OR (
                CASE WHEN country_code = 'UA' AND state_id NOT IN (-72639,-1574364) THEN
                    (name_uk != '' AND name_uk != name)
                WHEN country_code IN ('RU','BY') THEN
                    (name_ru != '' AND name_ru != name)
                ELSE
                    FALSE
                END
            ) OR (
                name != '' AND CASE WHEN country_code = 'UA' AND state_id NOT IN (-72639,-1574364) THEN
                    (name_uk != '' AND array_length(string_to_array(name, ' '), 1) != array_length(string_to_array(name_uk, ' '), 1))
                WHEN country_code IN ('RU','BY') THEN
                    (name_ru != '' AND array_length(string_to_array(name, ' '), 1) != array_length(string_to_array(name_ru, ' '), 1))
                ELSE
                    FALSE
                END
            ) OR (
                name != '' AND name !~ CASE WHEN country_code = 'UA' AND state_id NOT IN (-72639,-1574364) THEN
                    '^([АаБбВвГгҐґДдЕеЄєЖжЗзиІіїЇЙйКкЛлМмНнОоПпРрСсТтУуФфХхЦцЧчШшЩщьЮюЯя0-9XVI’\- \.\,\«\»\№]+) (вулиця|провулок|площа|проспект|бульвар|спуск|міст|проїзд|набережна|шосе|алея|в’їзд|тупик|підйом|лінія|дорога|дача|квартал|кілометр|просік|з’їзд|тунель|шляхопровід|естакада|метроміст|кільце|заїзд|масив|мікрорайон|тракт|урочище|узвіз|майдан|завулок)$'
                WHEN country_code IN ('RU','BY') THEN
                    '^([АаБбВвГгДдЕеЁёЖжЗзИиЙйКкЛлМмНнОоПпРрСсТтУуФфХхЦцЧчШшЩщъыьЭэЮюЯя0-9XVI\- \.\,\«\»\№]*)(( (улица|переулок|площадь|проспект|бульвар|спуск|мост|проезд|набережная|шоссе|аллея|въезд|тупик|подъём|линия|дорога|дача|квартал|километр|просек|съезд|тоннель|путепровод|эстакада|метромост|кольцо|заезд|массив|микрорайон|тракт|урочище|спуск|площадь|переулок))|( (улица|переулок|площадь|проспект|бульвар|спуск|мост|проезд|набережная|шоссе|аллея|въезд|тупик|подъём|линия|дорога|дача|квартал|километр|просек|съезд|тоннель|путепровод|эстакада|метромост|кольцо|заезд|массив|микрорайон|тракт|урочище|спуск|площадь|переулок) )|((улица|переулок|площадь|проспект|бульвар|спуск|мост|проезд|набережная|шоссе|аллея|въезд|тупик|подъём|линия|дорога|дача|квартал|километр|просек|съезд|тоннель|путепровод|эстакада|метромост|кольцо|заезд|массив|микрорайон|тракт|урочище|спуск|площадь|переулок) ))([АаБбВвГгДдЕеЁёЖжЗзИиЙйКкЛлМмНнОоПпРрСсТтУуФфХхЦцЧчШшЩщъыьЭэЮюЯя0-9XVI\- \.\,\«\»\№]*)$'
                ELSE
                    '.*'
                END
            ) OR (

                name_uk != '' AND name_uk !~ CASE WHEN country_code = 'UA' AND state_id NOT IN (-72639,-1574364) THEN
                    '^([АаБбВвГгҐґДдЕеЄєЖжЗзиІіїЇЙйКкЛлМмНнОоПпРрСсТтУуФфХхЦцЧчШшЩщьЮюЯя0-9XVI’\- \.\,\«\»\№]+) (вулиця|провулок|площа|проспект|бульвар|спуск|міст|проїзд|набережна|шосе|алея|в’їзд|тупик|підйом|лінія|дорога|дача|квартал|кілометр|просік|з’їзд|тунель|шляхопровід|естакада|метроміст|кільце|заїзд|масив|мікрорайон|тракт|урочище|узвіз|майдан|завулок)$'
                WHEN country_code IN ('RU','BY') THEN
                    '^([АаБбВвГгҐґДдЕеЄєЖжЗзиІіїЇЙйКкЛлМмНнОоПпРрСсТтУуФфХхЦцЧчШшЩщьЮюЯя0-9XVI’\- \.\,\«\»\№]*)(( (вулиця|провулок|площа|проспект|бульвар|спуск|міст|проїзд|набережна|шосе|алея|в’їзд|тупик|підйом|лінія|дорога|дача|квартал|кілометр|просік|з’їзд|тунель|шляхопровід|естакада|метроміст|кільце|заїзд|масив|мікрорайон|тракт|урочище|узвіз|майдан|завулок))|( (вулиця|провулок|площа|проспект|бульвар|спуск|міст|проїзд|набережна|шосе|алея|в’їзд|тупик|підйом|лінія|дорога|дача|квартал|кілометр|просік|з’їзд|тунель|шляхопровід|естакада|метроміст|кільце|заїзд|масив|мікрорайон|тракт|урочище|узвіз|майдан|завулок) )|((вулиця|провулок|площа|проспект|бульвар|спуск|міст|проїзд|набережна|шосе|алея|в’їзд|тупик|підйом|лінія|дорога|дача|квартал|кілометр|просік|з’їзд|тунель|шляхопровід|естакада|метроміст|кільце|заїзд|масив|мікрорайон|тракт|урочище|узвіз|майдан|завулок) ))([АаБбВвГгҐґДдЕеЄєЖжЗзиІіїЇЙйКкЛлМмНнОоПпРрСсТтУуФфХхЦцЧчШшЩщьЮюЯя0-9XVI’\- \.\,\«\»\№]*)$'
                ELSE
                    '.*'
                END
            ) OR (
                name_ru != '' AND name_ru !~ CASE WHEN country_code = 'UA' AND state_id NOT IN (-72639,-1574364) THEN
                    '^([АаБбВвГгДдЕеЁёЖжЗзИиЙйКкЛлМмНнОоПпРрСсТтУуФфХхЦцЧчШшЩщъыьЭэЮюЯя0-9XVI\- \.\,\«\»\№]+) (улица|переулок|площадь|проспект|бульвар|спуск|мост|проезд|набережная|шоссе|аллея|въезд|тупик|подъём|линия|дорога|дача|квартал|километр|просек|съезд|тоннель|путепровод|эстакада|метромост|кольцо|заезд|массив|микрорайон|тракт|урочище|спуск|площадь|переулок)$'
                ELSE
                    '^([АаБбВвГгДдЕеЁёЖжЗзИиЙйКкЛлМмНнОоПпРрСсТтУуФфХхЦцЧчШшЩщъыьЭэЮюЯя0-9XVI\- \.\,\«\»\№]*)(( (улица|переулок|площадь|проспект|бульвар|спуск|мост|проезд|набережная|шоссе|аллея|въезд|тупик|подъём|линия|дорога|дача|квартал|километр|просек|съезд|тоннель|путепровод|эстакада|метромост|кольцо|заезд|массив|микрорайон|тракт|урочище|спуск|площадь|переулок))|( (улица|переулок|площадь|проспект|бульвар|спуск|мост|проезд|набережная|шоссе|аллея|въезд|тупик|подъём|линия|дорога|дача|квартал|километр|просек|съезд|тоннель|путепровод|эстакада|метромост|кольцо|заезд|массив|микрорайон|тракт|урочище|спуск|площадь|переулок) )|((улица|переулок|площадь|проспект|бульвар|спуск|мост|проезд|набережная|шоссе|аллея|въезд|тупик|подъём|линия|дорога|дача|квартал|километр|просек|съезд|тоннель|путепровод|эстакада|метромост|кольцо|заезд|массив|микрорайон|тракт|урочище|спуск|площадь|переулок) ))([АаБбВвГгДдЕеЁёЖжЗзИиЙйКкЛлМмНнОоПпРрСсТтУуФфХхЦцЧчШшЩщъыьЭэЮюЯя0-9XVI\- \.\,\«\»\№]*)$'
                END
            ) OR (
                name_be != '' AND name_be !~ 
                    '^([АаБбВвГгДдЕеЁёЖжЗзІіЙйКкЛлМмНнОоПпРрСсТтУуЎўФфХхЦцЧчШшЫыЬьЭэЮюЯя0-9XVI’\- \.\,\«\»\№]*)(( (вуліца|завулак|плошча|праспект|бульвар|спуск|мост|праезд|набярэжная|шаша|алея|ўезд|тупік|ўздым|лінія|дарога|дача|квартал|кіламетр|прасек|з’езд|тунэль|пуцеправод|эстакада|метромост|кольца|заезд|масіў|мікрараён|тракт|урочышча|спуск|плошча|завулак))|( (вуліца|завулак|плошча|праспект|бульвар|спуск|мост|праезд|набярэжная|шаша|алея|ўезд|тупік|ўздым|лінія|дарога|дача|квартал|кіламетр|прасек|з’езд|тунэль|пуцеправод|эстакада|метромост|кольца|заезд|масіў|мікрараён|тракт|урочышча|спуск|плошча|завулак) )|((вуліца|завулак|плошча|праспект|бульвар|спуск|мост|праезд|набярэжная|шаша|алея|ўезд|тупік|ўздым|лінія|дарога|дача|квартал|кіламетр|прасек|з’езд|тунэль|пуцеправод|эстакада|метромост|кольца|заезд|масіў|мікрараён|тракт|урочышча|спуск|плошча|завулак) ))([АаБбВвГгДдЕеЁёЖжЗзІіЙйКкЛлМмНнОоПпРрСсТтУуЎўФфХхЦцЧчШшЫыЬьЭэЮюЯя0-9XVI’\- \.\,\«\»\№]*)$'
            )
);



UPDATE import.osm_streets
SET name_uk = name
WHERE name_uk = '' AND country_code = 'UA'
AND
(name ~ '^([АаБбВвГгҐґДдЕеЄєЖжЗзиІіїЇЙйКкЛлМмНнОоПпРрСсТтУуФфХхЦцЧчШшЩщьЮюЯя0-9XVI’\- \.\,\«\»\№]+) (вулиця|провулок|площа|проспект|бульвар|спуск|міст|проїзд|набережна|шосе|алея|в’їзд|тупик|підйом|лінія|дорога|дача|квартал|кілометр|просік|з’їзд|тунель|шляхопровід|естакада|метроміст|кільце|заїзд|масив|мікрорайон|тракт|урочище|узвіз|майдан|завулок)$')
;

UPDATE import.osm_streets
SET name_ru = name
WHERE name_ru = '' AND country_code IN ('RU','BY')
AND
(name ~ '
^([АаБбВвГгДдЕеЁёЖжЗзИиЙйКкЛлМмНнОоПпРрСсТтУуФфХхЦцЧчШшЩщъыьЭэЮюЯя0-9XVI\- \.\,\«\»\№]*)(( (улица|переулок|площадь|проспект|бульвар|спуск|мост|проезд|набережная|шоссе|аллея|въезд|тупик|подъём|линия|дорога|дача|квартал|километр|просек|съезд|тоннель|путепровод|эстакада|метромост|кольцо|заезд|массив|микрорайон|тракт|урочище|спуск|площадь|переулок))|( (улица|переулок|площадь|проспект|бульвар|спуск|мост|проезд|набережная|шоссе|аллея|въезд|тупик|подъём|линия|дорога|дача|квартал|километр|просек|съезд|тоннель|путепровод|эстакада|метромост|кольцо|заезд|массив|микрорайон|тракт|урочище|спуск|площадь|переулок) )|((улица|переулок|площадь|проспект|бульвар|спуск|мост|проезд|набережная|шоссе|аллея|въезд|тупик|подъём|линия|дорога|дача|квартал|километр|просек|съезд|тоннель|путепровод|эстакада|метромост|кольцо|заезд|массив|микрорайон|тракт|урочище|спуск|площадь|переулок) ))([АаБбВвГгДдЕеЁёЖжЗзИиЙйКкЛлМмНнОоПпРрСсТтУуФфХхЦцЧчШшЩщъыьЭэЮюЯя0-9XVI\- \.\,\«\»\№]*)$')
;

UPDATE import.osm_streets
SET name_be = name
WHERE name_be = '' AND country_code IN ('RU','BY')
AND
(name ~ '
^([АаБбВвГгДдЕеЁёЖжЗзІіЙйКкЛлМмНнОоПпРрСсТтУуЎўФфХхЦцЧчШшЫыЬьЭэЮюЯя0-9XVI’\- \.\,\«\»\№]*)(( (вуліца|завулак|плошча|праспект|бульвар|спуск|мост|праезд|набярэжная|шаша|алея|ўезд|тупік|ўздым|лінія|дарога|дача|квартал|кіламетр|прасек|з’езд|тунэль|пуцеправод|эстакада|метромост|кольца|заезд|масіў|мікрараён|тракт|урочышча|спуск|плошча|завулак))|( (вуліца|завулак|плошча|праспект|бульвар|спуск|мост|праезд|набярэжная|шаша|алея|ўезд|тупік|ўздым|лінія|дарога|дача|квартал|кіламетр|прасек|з’езд|тунэль|пуцеправод|эстакада|метромост|кольца|заезд|масіў|мікрараён|тракт|урочышча|спуск|плошча|завулак) )|((вуліца|завулак|плошча|праспект|бульвар|спуск|мост|праезд|набярэжная|шаша|алея|ўезд|тупік|ўздым|лінія|дарога|дача|квартал|кіламетр|прасек|з’езд|тунэль|пуцеправод|эстакада|метромост|кольца|заезд|масіў|мікрараён|тракт|урочышча|спуск|плошча|завулак) ))([АаБбВвГгДдЕеЁёЖжЗзІіЙйКкЛлМмНнОоПпРрСсТтУуЎўФфХхЦцЧчШшЫыЬьЭэЮюЯя0-9XVI’\- \.\,\«\»\№]*)$')
;

DROP FUNCTION prefix_search(needle ANYARRAY, haystack ANYARRAY);
CREATE FUNCTION prefix_search(needle ANYARRAY, haystack ANYARRAY)
RETURNS text[] AS $$
    SELECT ARRAY[i::text, (j-1)::text, (SELECT string_agg(v, ' ') FROM unnest($2) g(v) WHERE v <> $1[i])]
      FROM generate_subscripts($1, 1) AS i,
      generate_subscripts($2, 1) AS j
     WHERE $1[i] = $2[j]
     ORDER BY i
$$ LANGUAGE sql STABLE;

ALTER TABLE import.osm_streets
        ADD COLUMN prefix_uk character varying(250),
        ADD COLUMN prefix_ru character varying(250),
        ADD COLUMN prefix_be character varying(250),
        ADD COLUMN pname_uk character varying(250),
        ADD COLUMN pname_ru character varying(250),
        ADD COLUMN pname_be character varying(250),
        ADD COLUMN prefix_pos_uk smallint,
        ADD COLUMN prefix_pos_ru smallint,
        ADD COLUMN prefix_pos_be smallint;



UPDATE import.osm_streets s SET prefix_uk = s[1], pname_uk = s[3], prefix_pos_uk = s[2]::smallint FROM (
SELECT prefix_search(ARRAY[
'вулиця','провулок','площа','проспект','бульвар','спуск','міст','проїзд','набережна','шосе','алея','в’їзд','тупик','підйом','лінія','дорога','дача','квартал','кілометр','просік','з’їзд','тунель','шляхопровід','естакада','метроміст','кільце','заїзд','масив','мікрорайон','тракт','урочище','узвіз','майдан','завулок'
], string_to_array(name_uk, ' ')) AS s, string_to_array(name_uk, ' ') AS words, id
FROM import.osm_streets
) sub WHERE country_code = 'UA' AND name_uk != '' AND sub.id = s.id;


UPDATE import.osm_streets s SET prefix_ru = s[1], pname_ru = s[3], prefix_pos_ru = s[2]::smallint FROM (
SELECT prefix_search(ARRAY[
'улица','переулок','площадь','проспект','бульвар','спуск','мост','проезд','набережная','шоссе','аллея','въезд','тупик','подъём','линия','дорога','дача','квартал','километр','просек','съезд','тоннель','путепровод','эстакада','метромост','кольцо','заезд','массив','микрорайон','тракт','урочище','спуск','площадь','переулок'
],string_to_array(name_ru, ' ')) AS s, string_to_array(name_ru, ' ') AS words, id
FROM import.osm_streets
) sub WHERE name_ru != '' AND sub.id = s.id;

UPDATE import.osm_streets s SET prefix_be = s[1], pname_be = s[3], prefix_pos_be = s[2]::smallint FROM (
SELECT prefix_search(ARRAY[
'вуліца','завулак','плошча','праспект','бульвар','спуск','мост','праезд','набярэжная','шаша','алея','ўезд','тупік','ўздым','лінія','дарога','дача','квартал','кіламетр','прасек','з’езд','тунэль','пуцеправод','эстакада','метромост','кольца','заезд','масіў','мікрараён','тракт','урочышча','спуск','плошча','завулак'
],string_to_array(name_be, ' ')) AS s, string_to_array(name_be, ' ') AS words, id
FROM import.osm_streets
) sub WHERE country_code = 'BY' AND name_be != '' AND sub.id = s.id;

CREATE OR REPLACE FUNCTION update_parts() RETURNS TRIGGER AS $$
DECLARE
    ar text[];
BEGIN
    IF NEW.name_uk != OLD.name_uk THEN
      ar := prefix_search(ARRAY[
        'вулиця','провулок','площа','проспект','бульвар','спуск','міст','проїзд','набережна','шосе','алея','в’їзд','тупик','підйом','лінія','дорога','дача','квартал','кілометр','просік','з’їзд','тунель','шляхопровід','естакада','метроміст','кільце','заїзд','масив','мікрорайон','тракт','урочище','узвіз','майдан','завулок'
      ], string_to_array(NEW.name_uk, ' '));
      NEW.pname_uk := ar[3];
      NEW.prefix_pos_uk := ar[2];
      NEW.prefix_uk := ar[1];
    END IF;
    IF NEW.name_ru != OLD.name_ru THEN
      ar := prefix_search(ARRAY[
        'улица','переулок','площадь','проспект','бульвар','спуск','мост','проезд','набережная','шоссе','аллея','въезд','тупик','подъём','линия','дорога','дача','квартал','километр','просек','съезд','тоннель','путепровод','эстакада','метромост','кольцо','заезд','массив','микрорайон','тракт','урочище','спуск','площадь','переулок'
      ],string_to_array(NEW.name_ru, ' '));
      NEW.pname_ru := ar[3];
      NEW.prefix_pos_ru := ar[2];
      NEW.prefix_ru := ar[1];
    END IF;
    IF NEW.name_be != OLD.name_be THEN
      ar := prefix_search(ARRAY[
        'вуліца','завулак','плошча','праспект','бульвар','спуск','мост','праезд','набярэжная','шаша','алея','ўезд','тупік','ўздым','лінія','дарога','дача','квартал','кіламетр','прасек','з’езд','тунэль','пуцеправод','эстакада','метромост','кольца','заезд','масіў','мікрараён','тракт','урочышча','спуск','плошча','завулак'
      ],string_to_array(NEW.name_be, ' '));
      NEW.pname_be := ar[3];
      NEW.prefix_pos_be := ar[2];
      NEW.prefix_be := ar[1];
    END IF;

    NEW.has_error :=
      ((
          trim(both ' ' from regexp_replace(NEW.name, '\A\s*', '')) != NEW.name
          OR trim(both ' ' from regexp_replace(NEW.name_uk, '\A\s*', '')) != NEW.name_uk
          OR trim(both ' ' from regexp_replace(NEW.name_ru, '\A\s*', '')) != NEW.name_ru
          OR trim(both ' ' from regexp_replace(NEW.name_be, '\A\s*', '')) != NEW.name_be
      ) OR (
          CASE WHEN NEW.country_code = 'UA' AND NEW.state_id NOT IN (-72639,-1574364) THEN
              (NEW.name_uk != '' AND NEW.name_uk != NEW.name)
          WHEN NEW.country_code IN ('RU','BY') THEN
              (NEW.name_ru != '' AND NEW.name_ru != NEW.name)
          ELSE
              FALSE
          END
      ) OR (
          NEW.name != '' AND CASE WHEN NEW.country_code = 'UA' AND NEW.state_id NOT IN (-72639,-1574364) THEN
              (NEW.name_uk != '' AND array_length(string_to_array(NEW.name, ' '), 1) != array_length(string_to_array(NEW.name_uk, ' '), 1))
          WHEN NEW.country_code IN ('RU','BY') THEN
              (NEW.name_ru != '' AND array_length(string_to_array(NEW.name, ' '), 1) != array_length(string_to_array(NEW.name_ru, ' '), 1))
          ELSE
              FALSE
          END
      ) OR (
          NEW.name != '' AND NEW.name !~ CASE WHEN NEW.country_code = 'UA' AND NEW.state_id NOT IN (-72639,-1574364) THEN
              '^([АаБбВвГгҐґДдЕеЄєЖжЗзиІіїЇЙйКкЛлМмНнОоПпРрСсТтУуФфХхЦцЧчШшЩщьЮюЯя0-9XVI’\- \.\,\«\»\№]+) (вулиця|провулок|площа|проспект|бульвар|спуск|міст|проїзд|набережна|шосе|алея|в’їзд|тупик|підйом|лінія|дорога|дача|квартал|кілометр|просік|з’їзд|тунель|шляхопровід|естакада|метроміст|кільце|заїзд|масив|мікрорайон|тракт|урочище|узвіз|майдан|завулок)$'
          WHEN NEW.country_code IN ('RU','BY') THEN
              '^([АаБбВвГгДдЕеЁёЖжЗзИиЙйКкЛлМмНнОоПпРрСсТтУуФфХхЦцЧчШшЩщъыьЭэЮюЯя0-9XVI\- \.\,\«\»\№]*)(( (улица|переулок|площадь|проспект|бульвар|спуск|мост|проезд|набережная|шоссе|аллея|въезд|тупик|подъём|линия|дорога|дача|квартал|километр|просек|съезд|тоннель|путепровод|эстакада|метромост|кольцо|заезд|массив|микрорайон|тракт|урочище|спуск|площадь|переулок))|( (улица|переулок|площадь|проспект|бульвар|спуск|мост|проезд|набережная|шоссе|аллея|въезд|тупик|подъём|линия|дорога|дача|квартал|километр|просек|съезд|тоннель|путепровод|эстакада|метромост|кольцо|заезд|массив|микрорайон|тракт|урочище|спуск|площадь|переулок) )|((улица|переулок|площадь|проспект|бульвар|спуск|мост|проезд|набережная|шоссе|аллея|въезд|тупик|подъём|линия|дорога|дача|квартал|километр|просек|съезд|тоннель|путепровод|эстакада|метромост|кольцо|заезд|массив|микрорайон|тракт|урочище|спуск|площадь|переулок) ))([АаБбВвГгДдЕеЁёЖжЗзИиЙйКкЛлМмНнОоПпРрСсТтУуФфХхЦцЧчШшЩщъыьЭэЮюЯя0-9XVI\- \.\,\«\»\№]*)$'
          ELSE
              '.*'
          END
      ) OR (

          NEW.name_uk != '' AND NEW.name_uk !~ CASE WHEN NEW.country_code = 'UA' AND NEW.state_id NOT IN (-72639,-1574364) THEN
              '^([АаБбВвГгҐґДдЕеЄєЖжЗзиІіїЇЙйКкЛлМмНнОоПпРрСсТтУуФфХхЦцЧчШшЩщьЮюЯя0-9XVI’\- \.\,\«\»\№]+) (вулиця|провулок|площа|проспект|бульвар|спуск|міст|проїзд|набережна|шосе|алея|в’їзд|тупик|підйом|лінія|дорога|дача|квартал|кілометр|просік|з’їзд|тунель|шляхопровід|естакада|метроміст|кільце|заїзд|масив|мікрорайон|тракт|урочище|узвіз|майдан|завулок)$'
          WHEN NEW.country_code IN ('RU','BY') THEN
              '^([АаБбВвГгҐґДдЕеЄєЖжЗзиІіїЇЙйКкЛлМмНнОоПпРрСсТтУуФфХхЦцЧчШшЩщьЮюЯя0-9XVI’\- \.\,\«\»\№]*)(( (вулиця|провулок|площа|проспект|бульвар|спуск|міст|проїзд|набережна|шосе|алея|в’їзд|тупик|підйом|лінія|дорога|дача|квартал|кілометр|просік|з’їзд|тунель|шляхопровід|естакада|метроміст|кільце|заїзд|масив|мікрорайон|тракт|урочище|узвіз|майдан|завулок))|( (вулиця|провулок|площа|проспект|бульвар|спуск|міст|проїзд|набережна|шосе|алея|в’їзд|тупик|підйом|лінія|дорога|дача|квартал|кілометр|просік|з’їзд|тунель|шляхопровід|естакада|метроміст|кільце|заїзд|масив|мікрорайон|тракт|урочище|узвіз|майдан|завулок) )|((вулиця|провулок|площа|проспект|бульвар|спуск|міст|проїзд|набережна|шосе|алея|в’їзд|тупик|підйом|лінія|дорога|дача|квартал|кілометр|просік|з’їзд|тунель|шляхопровід|естакада|метроміст|кільце|заїзд|масив|мікрорайон|тракт|урочище|узвіз|майдан|завулок) ))([АаБбВвГгҐґДдЕеЄєЖжЗзиІіїЇЙйКкЛлМмНнОоПпРрСсТтУуФфХхЦцЧчШшЩщьЮюЯя0-9XVI’\- \.\,\«\»\№]*)$'
          ELSE
              '.*'
          END
      ) OR (
          NEW.name_ru != '' AND NEW.name_ru !~ CASE WHEN NEW.country_code = 'UA' AND NEW.state_id NOT IN (-72639,-1574364) THEN
              '^([АаБбВвГгДдЕеЁёЖжЗзИиЙйКкЛлМмНнОоПпРрСсТтУуФфХхЦцЧчШшЩщъыьЭэЮюЯя0-9XVI\- \.\,\«\»\№]+) (улица|переулок|площадь|проспект|бульвар|спуск|мост|проезд|набережная|шоссе|аллея|въезд|тупик|подъём|линия|дорога|дача|квартал|километр|просек|съезд|тоннель|путепровод|эстакада|метромост|кольцо|заезд|массив|микрорайон|тракт|урочище|спуск|площадь|переулок)$'
          ELSE
              '^([АаБбВвГгДдЕеЁёЖжЗзИиЙйКкЛлМмНнОоПпРрСсТтУуФфХхЦцЧчШшЩщъыьЭэЮюЯя0-9XVI\- \.\,\«\»\№]*)(( (улица|переулок|площадь|проспект|бульвар|спуск|мост|проезд|набережная|шоссе|аллея|въезд|тупик|подъём|линия|дорога|дача|квартал|километр|просек|съезд|тоннель|путепровод|эстакада|метромост|кольцо|заезд|массив|микрорайон|тракт|урочище|спуск|площадь|переулок))|( (улица|переулок|площадь|проспект|бульвар|спуск|мост|проезд|набережная|шоссе|аллея|въезд|тупик|подъём|линия|дорога|дача|квартал|километр|просек|съезд|тоннель|путепровод|эстакада|метромост|кольцо|заезд|массив|микрорайон|тракт|урочище|спуск|площадь|переулок) )|((улица|переулок|площадь|проспект|бульвар|спуск|мост|проезд|набережная|шоссе|аллея|въезд|тупик|подъём|линия|дорога|дача|квартал|километр|просек|съезд|тоннель|путепровод|эстакада|метромост|кольцо|заезд|массив|микрорайон|тракт|урочище|спуск|площадь|переулок) ))([АаБбВвГгДдЕеЁёЖжЗзИиЙйКкЛлМмНнОоПпРрСсТтУуФфХхЦцЧчШшЩщъыьЭэЮюЯя0-9XVI\- \.\,\«\»\№]*)$'
          END
      ) OR (
          NEW.name_be != '' AND NEW.name_be !~ 
              '^([АаБбВвГгДдЕеЁёЖжЗзІіЙйКкЛлМмНнОоПпРрСсТтУуЎўФфХхЦцЧчШшЫыЬьЭэЮюЯя0-9XVI’\- \.\,\«\»\№]*)(( (вуліца|завулак|плошча|праспект|бульвар|спуск|мост|праезд|набярэжная|шаша|алея|ўезд|тупік|ўздым|лінія|дарога|дача|квартал|кіламетр|прасек|з’езд|тунэль|пуцеправод|эстакада|метромост|кольца|заезд|масіў|мікрараён|тракт|урочышча|спуск|плошча|завулак))|( (вуліца|завулак|плошча|праспект|бульвар|спуск|мост|праезд|набярэжная|шаша|алея|ўезд|тупік|ўздым|лінія|дарога|дача|квартал|кіламетр|прасек|з’езд|тунэль|пуцеправод|эстакада|метромост|кольца|заезд|масіў|мікрараён|тракт|урочышча|спуск|плошча|завулак) )|((вуліца|завулак|плошча|праспект|бульвар|спуск|мост|праезд|набярэжная|шаша|алея|ўезд|тупік|ўздым|лінія|дарога|дача|квартал|кіламетр|прасек|з’езд|тунэль|пуцеправод|эстакада|метромост|кольца|заезд|масіў|мікрараён|тракт|урочышча|спуск|плошча|завулак) ))([АаБбВвГгДдЕеЁёЖжЗзІіЙйКкЛлМмНнОоПпРрСсТтУуЎўФфХхЦцЧчШшЫыЬьЭэЮюЯя0-9XVI’\- \.\,\«\»\№]*)$'
      ));
    RETURN NEW;
END;
$$ LANGUAGE plpgsql;

--DROP TRIGGER IF EXISTS t_parts ON osm_streets CASCADE;
--CREATE TRIGGER t_parts BEFORE UPDATE ON import.osm_streets FOR EACH ROW EXECUTE PROCEDURE update_parts();